index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-08-24 토 07:06 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>HO YOUNG의 Recording</title>
<meta name="author" content="HO YOUNG" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">HO YOUNG의 Recording</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgf707749">환경</a>
<ul>
<li><a href="#org18417ba">Macbook</a></li>
<li><a href="#org77589e0">EMACS</a></li>
</ul>
</li>
<li><a href="#org6a2ceeb">로그</a>
<ul>
<li><a href="#org460052f">github.io 시작</a></li>
<li><a href="#org4b2f33e">한글맞춤법 설정 for macOS</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgf707749" class="outline-2">
<h2 id="orgf707749">환경</h2>
<div class="outline-text-2" id="text-orgf707749">
</div>
<div id="outline-container-org18417ba" class="outline-3">
<h3 id="org18417ba">Macbook</h3>
<div class="outline-text-3" id="text-org18417ba">
<ul class="org-ul">
<li>Macbook Air(M1),  macOS 14.6.1</li>
</ul>
</div>
</div>
<div id="outline-container-org77589e0" class="outline-3">
<h3 id="org77589e0">EMACS</h3>
<div class="outline-text-3" id="text-org77589e0">
<ul class="org-ul">
<li>emacs-version: 31.0.50,  자체 컴파일</li>
<li>org-version : 9.7.10</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org6a2ceeb" class="outline-2">
<h2 id="org6a2ceeb">로그</h2>
<div class="outline-text-2" id="text-org6a2ceeb">
</div>
<div id="outline-container-org460052f" class="outline-3">
<h3 id="org460052f">github.io 시작</h3>
<div class="outline-text-3" id="text-org460052f">
</div>
<div id="outline-container-orge231fc4" class="outline-4">
<h4 id="orge231fc4">Create a repository</h4>
<div class="outline-text-4" id="text-orge231fc4">
<ul class="org-ul">
<li>username.github.io</li>
<li>나머지는 기본값 유지</li>
</ul>
</div>
</div>
<div id="outline-container-org0a82547" class="outline-4">
<h4 id="org0a82547">Clone the repository</h4>
<div class="outline-text-4" id="text-org0a82547">
<div class="org-src-container">
<pre class="src src-nil">    - git clone git@github.com:username/username.github.io
</pre>
</div>
</div>
</div>
<div id="outline-container-orgce8c394" class="outline-4">
<h4 id="orgce8c394">add an index.html file</h4>
<div class="outline-text-4" id="text-orgce8c394">
<div class="org-src-container">
<pre class="src src-nil">    - cd username.github.io
    - echo "Hello World" &gt; index.html
</pre>
</div>
</div>
</div>
<div id="outline-container-org9c09586" class="outline-4">
<h4 id="org9c09586">Push it</h4>
<div class="outline-text-4" id="text-org9c09586">
<div class="org-src-container">
<pre class="src src-nil">    - git add --all
    - git commit -m "Initial commit"
    - git push -u origin main
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org4b2f33e" class="outline-3">
<h3 id="org4b2f33e">한글맞춤법 설정 for macOS</h3>
<div class="outline-text-3" id="text-org4b2f33e">
</div>
<div id="outline-container-orgd6f3b85" class="outline-4">
<h4 id="orgd6f3b85">hunspell 설치</h4>
<div class="outline-text-4" id="text-orgd6f3b85">
<div class="org-src-container">
<pre class="src src-nil">    brew install hunspell
</pre>
</div>
</div>
</div>
<div id="outline-container-org4506356" class="outline-4">
<h4 id="org4506356">한국어 사전 다운로드</h4>
<div class="outline-text-4" id="text-org4506356">
<p>
<a href="https://github.com/spellcheck-ko/hunspell-dict-ko/releases">https://github.com/spellcheck-ko/hunspell-dict-ko/releases</a>
</p>
<ul class="org-ul">
<li>ko-aff-dic-0.7.94.zip 파일 다운로드</li>
</ul>
</div>
</div>
<div id="outline-container-org8a5c84b" class="outline-4">
<h4 id="org8a5c84b">사전 파일 설치</h4>
<div class="outline-text-4" id="text-org8a5c84b">
<p>
다운로드한 사전 파일을 Hunspell이 인식할 수 있는 디렉토리에 복사. 보통 ~/Library/Spelling/ 디렉토리를 사용
</p>
<div class="org-src-container">
<pre class="src src-nil">    mkdir -p ~/Library/Spelling
    cp hunspell-dict-ko/ko.dic ~/Library/Spelling/ko_KR.dic
    cp hunspell-dict-ko/ko.aff ~/Library/Spelling/ko_KR.aff
</pre>
</div>
</div>
</div>
<div id="outline-container-org16a7fe6" class="outline-4">
<h4 id="org16a7fe6">Emacs 설정</h4>
<div class="outline-text-4" id="text-org16a7fe6">
<ul class="org-ul">
<li>( ~/.emacs.d/init.el)에 Hunspell과 한국어 사전을 사용할 수 있도록 설정</li>
</ul>
<div class="org-src-container">
<pre class="src src-nil">    ;; Hunspell 설정
    (setq ispell-program-name "hunspell")
    (setq ispell-local-dictionary "ko_KR")
    (setq ispell-local-dictionary-alist
    '(("ko_KR" "[가-힣]" "[^가-힣]" "[-']" nil ("-d" "ko_KR") nil utf-8)))
    ;; Flyspell 모드 활성화
    (add-hook 'text-mode-hook 'flyspell-mode)
    (add-hook 'prog-mode-hook 'flyspell-prog-mode)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-nil">    ;; use-package 사용 예
    (use-package ispell
      :config
    (setq ispell-program-name "hunspell")
    (setq ispell-local-dictionary "ko_KR")
    (setq ispell-local-dictionary-alist
         '(("ko_KR" "[가-힣]" "[^가-힣]" "[-']" nil ("-d" "ko_KR") nil utf-8))))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb73ee52" class="outline-4">
<h4 id="orgb73ee52">flyspell 모드 사용</h4>
<div class="outline-text-4" id="text-orgb73ee52">
<ul class="org-ul">
<li>Emacs에서 Flyspell 모드를 사용하여 실시간 맞춤법 검사. 텍스트 모드나 프로그래밍 모드에서 자동 활성화</li>
</ul>
</div>
</div>
<div id="outline-container-orgf14303d" class="outline-4">
<h4 id="orgf14303d">한글맞춤법 수동검사</h4>
<div class="outline-text-4" id="text-orgf14303d">
<div class="org-src-container">
<pre class="src src-nil">    ;; 맞춤법 검사 - 수동 검사
    (defun my-hunspell-check ()
    "Run Hunspell spell check on the current buffer."
    (interactive)
    (ispell-buffer))
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: HO YOUNG</p>
<p class="date">Created: 2024-08-24 토 07:06</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
